def need_internet(text):
    text = text.lower().strip()

    words = [
        "сегодня",
        "сейчас",
        "последние новости",
        "новости",
        "погода",
        "курс",
        "цена",
        "bitcoin",
        "btc",
        "доллар",
        "евро",
        "акции",
        "крипто",
        "матч",
        "счёт",
        "результат",
        "когда вышел",
        "что произошло",
        "что нового",
        "последние данные",
        "актуальная информация"
    ]

    return any(word in text for word in words)